In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [13]:
# crediantials-
hostname="localhost"
uname="root"
pwd="agmathur"
dbname="ramaninfotech1"
tablename="students46"

In [14]:
engine=create_engine("mysql+pymysql://{user}:{pw}@{host}/{db}".format(user=uname,host=hostname,pw=pwd,db=dbname))
df=pd.read_sql("students46",engine)
df

   stud_id stud_name stud_address  stud_age
0        4    aayush       jaipur        21
1        2    gaurav        ajmer        22
2        3      ajay       jaipur        21